Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J69.tmx
Source language: en_us
Languages: zh_cn

source: Chapter 1 Definitions and Nomenclature
zh_cn: 第1章 定义和术语

source: This chapter presents some basic radar definitions and establishes much of the nomenclature used throughout this text.
zh_cn: 本章介绍了一些基本的雷达定义并建立了本书使用的大多数术语。

source: The word radar is an abbreviation for radio detection and ranging.
zh_cn: 雷达（Radar）这个词是无线电探测和定位（Radio Detection and Ranging）几个英文单词的缩写。

source: In most cases, radar systems use modulated waveforms and directive antennas to transmit electromagnetic energy into a specific volume in space to search for targets.
zh_cn: 通常，雷达系统使用调制的波形和定向天线向空间中的特定空域发射电磁波以搜索目标。

source: Objects (targets) within a search volume will reflect portions of the incident energy (radar returns or echoes) in the direction of the radar.
zh_cn: 搜索空域内的物体（目标）把入射能量的一部分（雷达返回或回波）向雷达方向反射。

source: These echoes are then processed by the radar receiver to extract target information such as range, velocity, angular position, and other target identifying characteristics.
zh_cn: 然后，雷达接收机处理这些回波，从中提取距离、速度、角度位置和其他目标识别特征等目标信息。

source: 1.1.Radar Systems Classifications and Bands
zh_cn: 1.1雷达系统的分类和波段

source: Radars can be classified as ground-based, airborne, spaceborne, or ship-based radar systems. They can also be classified into numerous categories based on the specific radar characteristics, such as the frequency band, antenna type, and waveforms utilized.
zh_cn: 雷达可以分为陆基、机载、星载或舰载雷达系统，也可以按照雷达的具体特征分成多种类别，例如根据使用的频带、天线类型和使用的波形等来分类。

source: Radar systems using continuous waveforms, modulated or otherwise, are classified as Continuous Wave (CW) radars.
zh_cn: 使用连续波、调制或其他方式的雷达系统，被分类为连续波（CW）雷达。

source: Alternatively, radar systems using time-limited pulsed waveforms are classified as Pulsed Radars.
zh_cn: 另外，使用时间有限脉冲波形的雷达系统被分类为脉冲雷达。

source: Another radar systems classification is concerned with the mission and/or the functionality of the specific radar. This includes: weather, acquisition and search, tracking, track-while-scan, fire control, early warning, over-the-horizon, terrain following, and terrain avoidance radars.
zh_cn: 其他雷达系统的分类方法主要是与特定雷达的任务和/或功能有关，这包括气象、截获和搜索、跟踪、边搜索边跟踪、火控、预警、超视距、地形跟随和地形回避雷达等。

source: Phased array radars utilize phased array antennas, and are often called multifunction (multimode) radars.
zh_cn: 相控阵雷达使用相控阵天线，通常称为多功能 （多模式）雷达。

source: A phased array is a composite antenna formed from two or more basic radiators.
zh_cn: 相控阵是由两个或更多个基本辐射单元组成的天线。

source: Array antennas synthesize narrow directive beams that may be steered, mechanically or electronically. Electronic steering is achieved by controlling the phase of the electric current feeding the array elements, and thus the name phased arrays is adopted.
zh_cn: 阵列天线合成机械转动的或电子转动的窄定向波束，通过控制馈给阵列各单元电流的相位可以实现电扫描，因此取名相控阵。

source: Historically, radars were first developed as military tools.
zh_cn: 历史上，雷达最初作为军用工具进行研发。

source: It is for this primary reason the most common radar systems classification is the letter or band designation originally used by the military during and after World War II.
zh_cn: 由于这个主要原因，在第二次世界大战期间及之后，大多数常用雷达系统分类使用了起初由军队使用的字母或频带名称。

source: This letter or band designation has also been adopted as an IEEE (Institute of Electrical and Electronics Engineers) standard.
zh_cn: 这种字母或频带名称也己经作为IEEE（电气和电子工程师协会）标准。

source: In recent years, NATO (North Atlantic Treaty Organization) has adopted a new band designation with easier abecedarian letters.
zh_cn: 近年来，NATO（北大西洋公约组织）已经采用了一种新的频带名称，其字母更简单。

source: Figure 1.1 shows the spectrum associated with these two letter or band radar classifications, while Table 1.1 presents the same information in a structured format.
zh_cn: 图1.1给出了与这些双字母或频带雷达分类有关的频谱，而表1.1用一种结构化的格式给出了同样的信息。

source: Figure 1.1. Radar systems band or letter classification.
zh_cn: 图1.1 雷达系统频带或字母分类

source: Table 1.1. Radar systems band or letter classification.
zh_cn: 表1.1 雷达系统频段或字母分类

source: High Frequency (HF) and Very High Frequency (VHF) Radars (A- and B-Bands):
zh_cn: 高频（HF）和甚高频（VHF）

source: These radar bands below 300MHz represent the frontier of radio technology at the time during the World War II.
zh_cn: 雷达（A和B频带）：在第二次世界大战期间，这些300MHz以下的雷达频带代表了雷达技术的前沿。

source: However, in the modern radar era, these frequencies bands are used for early warning radars.
zh_cn: 然而，在现代雷达时期，这些频带用于预警雷达。

source: These radars utilize the electromagnetic waves’ reflection off the ionosphere to detect targets beyond the horizon, and so they are called Over-the-Horizon Radars (OTHR).
zh_cn: 这些雷达利用来自电离层的电磁波反射来探测地平面以下的目标，因此它们被称为超视距雷达（OTHR）。

source: Some examples include the United States (U.S.) Navy Relocatable over-the-horizon Radar (ROTHR) shown in Fig. 1.2, and the Russian Woodpecker radar shown in Fig. 1.3.
zh_cn: 超视距雷达的例子包括图1.2中所示的美国海军的可再定位超视距雷达 （ROTHR），以及图1.3中所示的俄罗斯的“啄木鸟”（Woodpecker）雷达。

source: By using these low HF and VHF frequency bands, one can use high-power transmitters.
zh_cn: 通过使用这些低HF和VHF频带，可以使用高功率发射机。

source: At these frequencies, the electromagnetic wave atmospheric attenuation is small and can be overcome by using high-power transmitters.
zh_cn: 在这些频率上，电磁波的大气衰减很小，并且可以使用高功率发射机来克服。

source: Radar angular measurement accuracies are limited in these bands because lower frequencies require antennas with significant physical size, thus limiting the radar’s angle accuracy and angle resolution.
zh_cn: 由于较低频率需要极大物理尺寸的天线，所以雷达角测量精度在这些频带上受限，从而限制了雷达的角精度和角分辨率。

source: Other communication and broadcasting services typically use these frequency bands.
zh_cn: 其他通信和广播服务通常使用这些频带。

source: Therefore, the available bandwidth for military radar systems is limited and highly contested throughout the world.
zh_cn: 因此军用雷达系统可用的带宽很有限，并在世界范围内高度竞争。

source: Low-frequency systems can be used for Foliage Penetration (FoPen) applications, as well as in Ground Penetrating (GPen) applications.
zh_cn: 低频率系统可用于树叶穿透（FoPen）应用及地面穿透（GPen）应用。

source: Figure 1.2. U. S. Navy over-the-horizon Radar.
zh_cn: 图1.2美国海军使用的可再定位超视距雷达。

source: Figure 1.3. Russian Woodpecker OTHR radar. Photograph obtained via the Internet.
zh_cn: 图1.3俄罗斯的“啄木鸟” OTHR雷达。

source: Ultra High Frequency (UHF) Radars (C-Band): UHF bands are used for very long range Early Warning Radars (EWR).
zh_cn: 超高频（UHF）雷达（C波段）：UHF频带用于超长距离的预警雷达（EWR）。

source: Some examples include the Ballistic Missile Early Warning System (BMEWS) search-and-track monopulse radar that operates at 245MHz (see Fig. 1.4), the Perimeter and Acquisition Radar (PAR), which is a very long range multifunction phased array radar; and the early warning PAVE PAWS multifunction UHF phased array radar.
zh_cn: 例子包括工作在245 MHz的弹道导弹预警系统（BMEWS）搜索和跟踪单脉冲雷达（见图1.4）， 周长和截获雷达（PAR）（这是一种超长距离多功能相控阵雷达），以及预警PAVE PAWS多功能UHF相控阵雷达。

source: This frequency band is also used for the detection and tracking of satellites and ballistic missiles over a long range.
zh_cn: 这个频段也用于长距离上的卫星和弹道导弹的跟踪与搜索。

source: In recent years, ultra wideband (UWB) radar applications use all frequencies in the A- to C-Bands.
zh_cn: 近年来，超宽带（UWB）雷达应用使用A到C频带的所有频率。

source: UWB radars can be used in GPen applications as well as in see-through- the-wall applications.
zh_cn: UWB雷达可用于GPen应用，也可用于穿墙应用。

source: Figure 1.4. Fylingdales BMEWS, United Kingdom.
zh_cn: 图1.4英国菲林戴尔BMEWS。

source: L-Band Radars (D-Band): Radars in the L-band are primarily ground-based and ship- based systems that are used in long range military and air traffic control search operations for up to 250 (~500Km) nautical miles.
zh_cn: L波段雷达（D波段）：L波段雷达主要是用于最远可达250海里（约500千米）的远距离军事和空中交通管制中搜索应用的陆基和舰载系统。

source: Therefore, due to earth curvature their maximum achievable range is limited when detecting low-altitude targets which can disappear very quickly below the horizon.
zh_cn: 由于地球曲率，所以探测低高度目标的最大可达距离受限，这些目标可能很快消失在地平面下。

source: The Air Traffic Management (ATM) long-range surveillance radars like the Air Route Surveillance Radar (ARSR), work in this frequency band.
zh_cn: 空中交通管制（ATM）远距离监视雷达如航线监视雷达（ARSR）等工作在这个频段。

source: These radar systems are relatively large and demand sizable footprints.
zh_cn: 这些雷达系统相对较大，需要很大的空间。

source: Historically, the designator L-Band was adopted since the “L” represent with large antenna or long range radars.
zh_cn: 历史上，因为“L”表示大天线或远距离雷达，所以采用了L波段这个名称。

source: S-Band Radars (E- and F-Bands): Most ground- and ship-based medium range radars operate in the S-band.
zh_cn: S波段雷达（E和F波段）：大多数陆基和舰载中距离雷达工作在S波段。

source: For example, the Airport Surveillance Radar (ASR) used for air traffic control, and the ship-based U.S. Navy AEGIS (Fig. 1.5) multifunction phased array are S-band radars, and the Airborne Warning and Control System (AWACS) shown in Fig. 1.6.
zh_cn: 例如，用于 空中交通管制的机场监视雷达（ASR），舰载美国海军宙斯盾（见图1.5）多功能相控阵雷 达，以及图1.6中所示的机载报警与控制系统（AWACS）都是S波段雷达。

source: The atmospheric attenuation in this band is higher than in the D-Band, and they are also more susceptible to weather conditions.
zh_cn: 这个波段中的大气衰减比D波段高，同时它们更易受天气条件的影响。

source: Radar in this band usually need considerably high transmitting power as compared to the lower-frequency radars in order to achieve maximum detection range.
zh_cn: 与较低频率的雷达相比，为达到最大探测距离，这个频段中的雷达通常需要相当高的发射功率。

source: Even with the considerable weather susceptibility, the National Weather Service Next Generation Doppler Weather Radar (NEXRAD) uses an S-band radar, because it can see beyond a severe storm.
zh_cn: 虽然对天气相当敏感，但美国国家气象服务下一代多普勒气象雷达（NEXRAD）仍然使用一部S波段雷达，这是因为它可以穿过大暴雨进行探测。

source: Special Airport Surveillance Radars (ASR) used at some civilian airports are also in this band where they can detect aircrafts for up to 60 nautical miles.
zh_cn: 在一些民用机场使用的特殊机场监视雷达（ASR）也处于 这个波段，它们可以探测到最远60海里处的飞机。

source: The designator S-Band (contrary to L-Band) was adopted since the “S” represents the smaller antennas or shorter range radars.
zh_cn: 因为“S”表示较小的天线或较近距离雷达，所以采用了S波段这个名称（与L波段相反）。

source: Figure 1.5. U. S. Navy AEGIS.
zh_cn: 图1.5美国海军宙斯盾。

source: Figure 1.6. U. S. Air Force AWACS.
zh_cn: 图1.6美国空军AWACS。

source: C-Band Radar (G-Band): Many of the mobile military battlefield surveillance, missile- control and ground surveillance radar systems operate in this band.
zh_cn: C波段雷达（G波段）：许多机动军事战场监视、导弹控制及地面监视雷达系统工作在 这个波段。

source: Most weather radar systems are also C-band radars.
zh_cn: 大多数气象雷达系统也是C波段雷达。

source: Medium range search and fire control military radars and metric instrumentation radars are C-band systems.
zh_cn: 中程搜索和火控军用雷达与精密测量雷达均是C波段系统。

source: In this band, the size of the antenna allows for achieving excellent angular accuracies and resolution.
zh_cn: 在这个频段中，天线尺寸允许获得很好的角精度和分辨率。

source: Performance of systems operating in this band suffer severely from bad weather conditions and to counter that, they often employ antenna feeds with circular polarization.
zh_cn: 工作在这个波段的系统性能受恶劣天气的影响很严重，为了对抗这个影响，系统常采用圆极化天线馈源。

source: X- and Ku-Band Radars (I- and J-Bands): In the X-band frequency range (8 to 12GHz) the relationship between the wave length and size of the antenna is considerably better than in lower-frequency bands.
zh_cn: X和Ku波段雷达（I和J波段）：在X波段频率范围内（8~12GHz），波长和天线尺寸的关系要比较低频率波段中好得多。

source: Radar systems that require fine target detection capabilities and yet cannot tolerate the atmospheric attenuation of higher-frequency bands are typically X-Band.
zh_cn: 要求好的目标探测能力，同时不能容忍更高频段的大气衰减的雷达系统通常是X波段。

source: The X- and Ku-bands are relatively popular radar frequency bands for military applications like airborne radars, since the small antenna size provides good performance.
zh_cn: 对于如机载雷达等军事应用来说，X和Ku波段是相 对常用的雷达频段，这是因为小天线尺寸提供了很好的性能。

source: Missile guidance systems use the Ku-Band (I- and J-Bands) because of the convenient antenna size where weight is a limiting requirement.
zh_cn: 因为天线尺寸合适，所以导弹制导系统使用Ku波段（I和J波段），这里的天线重量是个限制条件。

source: Space borne or airborne imaging radars used in Synthetic Aperture Radar (SAR) for military electronic intelligence and civil geographic mapping typically use these frequency bands.
zh_cn: 对于军事电子情报和民用地理地图，在合成孔径雷达（SAR）中使用的星载或机载成像雷达通常使用这些频段。

source: Finally, these frequency bands are also widely used in maritime civil and military navigation radars.
zh_cn: 最后，这些频段也在海事民事和军用导航雷达中广泛使用。

source: K- and Ka- Band Radars (J- and K-Bands): These high-frequency bands suffer severe weather and atmospheric attenuation.
zh_cn: K和Ka波段雷达（J和K波段）：这些高频波段受天气和大气衰减的影响严重。

source: Therefore, radars utilizing these frequency bands are limited to short range applications, such as police traffic radars, short range terrain avoidance, and terrain following radars.
zh_cn: 因此使用这些频段的雷达限于近程应用，例如警察交通雷达、近程地形回避及地形跟随雷达。

source: Alternatively, the achievable angular accuracies and range resolution are superior to other bands.
zh_cn: 另外，可达到的角精度和距离分辨率比其他波段都高。

source: In ATM applications these radars are often called Surface Movement Radar (SMR) or Airport Surface Detection Equipment (ASDE) radars.
zh_cn: 在ATM应用中，这些雷达通常称为地面活动监视雷达（SMR）或机场地面探测设备（ASDE）雷达。

source: Millimeter Wave (MMW) Radars (V- and W-Bands): Radars operating in this frequency band also suffer from severe high atmospheric attenuation.
zh_cn: 毫米波（MMW）雷达（V和W波段）：工作在这个频段的雷达也受高大气衰减的严重影响。

source: Radar applications are limited to very short range of up to a tens of meters.
zh_cn: 雷达应用限制在最多数十米的极近程。

source: In the W-Band maximum attenuation occurs at about 75GHz and at about 96GHz.
zh_cn: 在W波段中，最大衰减出现在大约75 GHz 和大约96GHz处。

source: Both of these frequencies are used in practice primarily in automotive industry where very small radars (~75-76GHz) are used for parking assistants, blind spot and brake assists.
zh_cn: 实践中这两个频率主要应用于汽车工业中，它们使用很小的雷达（约 75~76 GHz）作为停车助手、盲点及刹车辅助。

source: Some radar systems operating at 96 to 98GHz are used as laboratory experimental or prototype systems.
zh_cn: 某些工作在96 GHz到98 GHz的雷达系统用于实验室实验或原型系统。

source: 1.2. Pulsed and Continuous Wave (CW) Radars
zh_cn: 1.2 脉冲和连续波（CW）雷达

source: When the type of waveform is used as a classifier of radar systems, there are two types of radars; pulsed and Continuous Wave (CW) radar systems.
zh_cn: 当把波形类型用做雷达系统的分类特征时，这里有两种雷达：脉冲和连续波（CW）雷达系统。

source: Continuous wave radars are those that continuously emit electromagnetic energy, and use separate transmit and receive antennas.
zh_cn: 连续波雷达是那些连续发射电磁能量的雷达，它们使用分置的发射和接收天线。

source: Unmodulated CW radars can accurately measure target radial velocity (Doppler shift) and angular position.
zh_cn: 无调制连续波雷达能精确测量目标径向速度（多普勒频移）和角位置。

source: Continuous wave waveforms can be viewed as pure sinewaves of the form cos2πf0t.
zh_cn: 连续波波形可看成是cos2πf0t形式的纯正弦波。

source: Spectra of the radar echo from stationary targets and clutter will be concentrated around f0.
zh_cn: 来自静止目标和杂波的雷达回波频谱将集中在f0周围。

source: The center frequency for the echoes of a moving target will be shifted by fd, the Doppler frequency.
zh_cn: 一个移动目标回波的中心频率将移动fd，也即多普勒频率。

source: Thus, by measuring this frequency difference, CW radars can very accurately extract target radial velocity.
zh_cn: 因此通过测量频率差，CW雷达可以非常精确地提取目标径向速度。

source: Because of the continuous nature of CW emission, range measurement is not possible without some modifications to the radar operations and waveforms.
zh_cn: 由于连续波发射的连续性，因此如果不对雷达工作和波形进行一些修正，就不可能进行距离测量。

source: Simply put, target range information cannot be extracted without utilizing some form of modulation.
zh_cn: 简单来说，不使用某些形式的调制就不能提取目标距离信息。

source: The primary use of CW radars is in target velocity search and track, and in missile guidance operations.
zh_cn: CW雷达的主要用途是目标速度搜索和跟踪，以及导弹制导工作。

source: Pulsed radars use a train of pulsed waveforms (mainly with modulation).
zh_cn: 脉冲雷达使用一个脉冲波形串（一般带有调制）。

source: In this category, radar systems can be classified on the basis of the Pulse Repetition Frequency (PRF), as low PRF, medium PRF, and high PRF radars.
zh_cn: 在这种类型中，可以根据脉冲重复频率（PRF）将雷达系统分类为低重频、中重频和高重频雷达。

source: Low PRF radars are primarily used for ranging where target velocity (Doppler shift) is not of interest.
zh_cn: 低重频雷达主要用于对目标速度（多普勒频移）不感兴趣时的测距。

source: High PRF radars are mainly used to measure target velocity.
zh_cn: 高重频雷达主要用于测量目标速度。

source: Continuous wave as well as pulsed radars can measure both target range and radial velocity by utilizing different modulation schemes. The design, operation, and analysis of CW and pulsed radar systems are found in subsequent chapters of this book.
zh_cn: 通过利用不同的调制方案，连续波及脉冲雷达既可以测量目标速度也可以测量径向速度，连续波和脉冲雷达系统的设计、工作和分析等内容可在后续章节中找到。

source: 1.3. Range
zh_cn: 1.3距离

source: Figure 1.7 shows a simplified pulsed radar block diagram.
zh_cn: 图1.7给出了简化的脉冲雷达框图。

source: The time control box generates the synchronization timing signals required throughout the system.
zh_cn: 时间控制方框产生整个系统所需的同步定时信号。

source: A modulated signal is generated and sent to the antenna by the modulator/transmitter block.
zh_cn: 调制器/发射机方框产生调制信号并将其送到天线。

source: Switching the antenna between the transmitting and receiving modes is controlled by the duplexer.
zh_cn: 双工器控制发射模式和接收模式之间的天线转接。

source: The duplexer allows one antenna to be used to both transmit and receive.
zh_cn: 双工器可使一副天线同时用于发射和接收。

source: During transmission it directs the radar electromagnetic energy toward the antenna. Alternatively, on reception, it directs the received radar echoes to the receiver.
zh_cn: 在发射过程中，双工器把雷达的电磁能量引向天线；而在接收期间，则把接收到的雷达回波引向接收机。

source: The receiver amplifies the radar returns and prepares them for signal processing.
zh_cn: 接收机把雷达返回信号进行放大，随即准备进行信号处理。

source: Extraction of target information is performed by the signal processor block.
zh_cn: 信号处理器方框进行目标信息的提取。

source: The target’s range, R, is computed by measuring the time delay, Δt; it takes a pulse to travel the two-way path between the radar and the target.
zh_cn: 目标距离R可以通过测量时间延迟Δt来计算，Δt是脉冲在雷达与目标之间往返所花费的时间。

source: Since electromagnetic waves travel at the speed of light, c = 3×108 m/s, then . . . where R is in meters and Δt is in seconds.
zh_cn: 由于电磁波以光速c = 3×108 m/s 传播，所以. . .式中，R的单位是m （米），Δt的单位是s （秒）。

source: The factor of 1/2 is used to account for the two-way time delay.
zh_cn: 因子1/2用于考虑往返的时间延迟。

source: In general, a pulsed radar transmits and receives a train of pulses, as illustrated by Fig. 1.8.
zh_cn: 通常，脉冲雷达发射和接收一串脉冲，如图1.8所示。

source: The Inter Pulse Period (IPP) is T, and the pulse width is τ.
zh_cn: 脉冲之间的周期（IPP）为T，脉冲宽度为τ。

source: The IPP is often referred to as the Pulse Repetition Interval (PRI).
zh_cn: IPP通常被标为脉冲重复间隔（PRI）。

source: The inverse of the PRI is the PRF, which is denoted by ft, . . .
zh_cn: PRI的倒数就是PRF， PRF用ft表示：. . .

source: During each PRI the radar radiates energy only for . . . seconds and listens for target returns for the rest of the PRI.
zh_cn: 在每次PRI期间，雷达仅发射能量. . .秒，在余下的PRI中等待目标回波。

source: The radar transmitting duty cycle (factor) dt is defined as the ratio . . ..
zh_cn: 雷达发射占空因子dt的定义是比值. . .。
